Revit 2027 API
ViewSchedule.IsHeaderFrozen Property
 A static property defining if the schedule header frozen setting is turned on or off in current Revit Application Session.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsHeaderFrozen { get; set; }
Public Shared Property IsHeaderFrozen As Boolean
	Get
	Set
public:
static property bool IsHeaderFrozen {
	bool get ();
	void set (bool value);
}
static member IsHeaderFrozen : bool with get, set
Property Value
Boolean
Remarks
 The setting will be written into Revit.ini if users set the value. If users start multiple Revit sessions, the schedule header frozen setting might be different in each session. Revit.ini file stores the lastest setting no matter what the Revit session is.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace